gembok/app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `invoices`
WHERE `status` = 'pending'
---
        }

        // 3. Pending Invoices (Billing)
        $pendingInvoices = $db->table('invoices')->where('status', 'pending')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `trouble_tickets`
WHERE `status` IN ('pending','in_progress')
---
        }

        // 5. Pending Tickets (Support)
        $pendingTickets = $db->table('trouble_tickets')
            ->whereIn('status', ['pending', 'in_progress'])
            ->countAllResults();