gembok/app/Controllers/Billing.php

SELECT `packages`.*, COUNT(customers.id) as customer_count
FROM `packages`
LEFT JOIN `customers` ON `customers`.`package_id` = `packages`.`id`
GROUP BY `packages`.`id`
---
    public function packages()
    {
        $packages = $this->db->table('packages')
            ->select('packages.*, COUNT(customers.id) as customer_count')
            ->join('customers', 'customers.package_id = packages.id', 'left')
            ->groupBy('packages.id')
            ->get()->getResultArray();

SELECT `customers`.*, `packages`.`name` as `package_name`, `packages`.`price` as `package_price`
FROM `customers`
LEFT JOIN `packages` ON `packages`.`id` = `customers`.`package_id`
ORDER BY `customers`.`id` DESC
---
    public function customers()
    {
        $customers = $this->db->table('customers')
            ->select('customers.*, packages.name as package_name, packages.price as package_price')
            ->join('packages', 'packages.id = customers.package_id', 'left')
            ->orderBy('customers.id', 'DESC')
            ->get()->getResultArray();