gembok/app/Services/ConfigService.php

    public function get(string $key, $default = null)
    {
        // Always create fresh model instance to avoid caching issues
        $model = new SettingModel();
        $row = $model->find($key);
---
SELECT *
FROM `settings`
WHERE `settings`.`key` = 'MIKROTIK_HOST'