gembok/app/Services/WhatsappService.php

    private function loadSettings()
    {
        $settings = $this->db->table('settings')->get()->getResultArray();
---
SELECT *
FROM `settings`